Обработки/Reports/_ОтчетОДоходахИРасходахНПФБезВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахНПФБезВалюты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахНПФБезВалюты/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходах и расходах НПФ (Без валюты)",
		"0.34",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица",	НастройкиОтчета.Подписант);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ЕдиницаИзмерения",				НастройкиОтчета.ЕдиницаИзмерения);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	ВыполнитьЗапрос(Запрос, ЭтотОбъект.Период, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	ВыборкаШапка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Шапка").ПолучитьДанные().Выбрать();
	
	ЕдиницаИзмерения = Неопределено;
	СтрокаФормата = "ЧДЦ=2; ЧС=; ЧН=0,00; ЧО=0";
	ПредставлениеЕдиницыИзмерения = "руб.";
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ЕдиницаИзмерения", ЕдиницаИзмерения) Тогда
	
		Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда
			СтрокаФормата = "ЧДЦ=2; ЧО=0; ЧС = 3; ЧН=0,00";
			ПредставлениеЕдиницыИзмерения = "тыс. руб.";
		ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
			СтрокаФормата = "ЧДЦ=2; ЧО=0; ЧС = 6; ЧН=0,00";
			ПредставлениеЕдиницыИзмерения = "млн. руб.";
		КонецЕсли;
		
	КонецЕсли; 
	
	ВыборкаШапка.Следующий();
	
	ДатаНачала = ЭтотОбъект.Период.ДатаНачала;
	ДатаОкончания = ЭтотОбъект.Период.ДатаОкончания;
	
	Если ДатаОкончания < Дата(2024,9,30) Тогда
		Макет = ПолучитьМакет("Макет");
	Иначе // форма в редакции 6269-У от 27 сентября 2022
		Макет = ПолучитьМакет("Макет_6269У");
	КонецЕсли;
	ОбластьИмяФормы 	= Макет.ПолучитьОбласть("ИмяФормы");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Область(1, 4, 1, 6).Формат = СтрокаФормата;
	ОбластьСтрокаИтого 	= Макет.ПолучитьОбласть("СтрокаИтого");
	ОбластьСтрокаИтого.Область(1, 4, 1, 6).Формат = СтрокаФормата;
	
	ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
	
	Если ДатаНачала = НачалоМесяца(ДатаНачала) И КонецМесяца(ДатаНачала) = КонецМесяца(ДатаОкончания) Тогда
	
		ОбластьШапка.Параметры.ДатаОтчета = Формат(ДатаНачала, "ДФ='ММММ гггг'") + " г.";
		
	ИначеЕсли ДатаНачала = НачалоМесяца(ДатаНачала) И КонецДня(ДатаОкончания) = КонецМесяца(ДатаОкончания) Тогда
		
		ГодНачала = ?(Год(ДатаНачала) = Год(ДатаОкончания), " - ", Формат(ДатаНачала, "ДФ=' гггг ""г. - ""'"));
		ОбластьШапка.Параметры.ДатаОтчета = Формат(ДатаНачала, "ДФ='ММММ'") + ГодНачала + Формат(ДатаОкончания, "ДФ='ММММ гггг ""г. ""'");
		
	Иначе
		
		ГодНачала = ?(Год(ДатаНачала) = Год(ДатаОкончания), " - ", Формат(ДатаНачала, "ДФ=' гггг ""г. - ""'"));
		ОбластьШапка.Параметры.ДатаОтчета = Формат(ДатаНачала, "ДФ='дд ММММ'") + ГодНачала + Формат(ДатаОкончания, "ДФ='дд ММММ гггг ""г. ""'");
		
	КонецЕсли; 
	
	ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ЕдиницаИзмерения = ПредставлениеЕдиницыИзмерения;

	Если ДатаОкончания < Дата(2026,1,1) Тогда  ///#743287 
		ДокументРезультат.Вывести(ОбластьИмяФормы);
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьШапка);		
	
#Область ВыводДанных
	ТаблицаДоходовИРасходов = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ТаблицаДоходовИРасходов").ПолучитьДанные().Выгрузить();
	ТаблицаДоходовИРасходов.Сортировать("СчетКод, Символ");
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаДоходовИРасходов Из ТаблицаДоходовИРасходов Цикл
		
		ОбластьСтрока.Параметры.Заполнить(СтрокаДоходовИРасходов);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьСтрокаИтого.Параметры.НомерСтроки = НомерСтроки;
	ОбластьСтрокаИтого.Параметры.НаименованиеСтатьи = "Итого:";
	ОбластьСтрокаИтого.Параметры.Сумма		= ТаблицаДоходовИРасходов.Итог("Сумма");
	ОбластьСтрокаИтого.Параметры.СуммаВал	= ТаблицаДоходовИРасходов.Итог("СуммаВал");
	ОбластьСтрокаИтого.Параметры.Итого		= ТаблицаДоходовИРасходов.Итог("Итого");
		
	ДокументРезультат.Вывести(ОбластьСтрокаИтого);
#КонецОбласти	
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ВыполнитьЗапрос(Запрос, Период, Организация, СчетДоверительногоУправления) Экспорт
	
	//Запрос используется в других отчётах, например _РасчетДоходностиExcel
	//После изменения, проверить его работоспособность
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеРасходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	СписокСчетов.Добавить(ПланыСчетов.Единый.НалогНаПрибыль);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО);
	
	Запрос.УстановитьПараметр("НачалоПериода", 					Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 					Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериодаДата", 				Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации", 			Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ВалютаУчета", 					Организация.ВалютаУчета);
	Запрос.УстановитьПараметр("Счет", 							СписокСчетов);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ОФР,
		|	-ВЫБОР
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Валюта = &ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма,
		|	-ВЫБОР
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Валюта = &ВалютаУчета
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|	КОНЕЦ КАК СуммаВал,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			НЕ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
		|	-ВЫБОР
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Валюта = &ВалютаУчета
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	-ВЫБОР
		|		КОГДА НЕ ЕдиныйБухгалтерскийУчетОбороты.Счет.Валютный
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Валюта = &ВалютаУчета
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|	КОНЕЦ,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)
		|					ИЛИ ЛицевойСчетКор.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ПереопределениеКлассификацииУчетныхАктивовЦБ)),
		|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&КонецПериодаДата КАК ДатаОтчета,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления
		|ПОМЕСТИТЬ _Шапка
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&КонецПериода,
		|			ЮрФизЛицо = &ЮрФизЛицоОрганизации
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.ОФР КАК ОФР,
		|	СУММА(_ИтоговаяТаблица.Сумма) КАК Сумма,
		|	ГруппыФинансовогоУчетаДоходовРасходов.Код КАК Символ,
		|	ГруппыФинансовогоУчетаДоходовРасходов.Описание КАК НаименованиеСтатьи,
		|	СУММА(_ИтоговаяТаблица.СуммаВал) КАК СуммаВал,
		|	СУММА(_ИтоговаяТаблица.Сумма + _ИтоговаяТаблица.СуммаВал) КАК Итого,
		|	_ИтоговаяТаблица.Счет.Код КАК СчетКод
		|ПОМЕСТИТЬ _ТаблицаДоходовИРасходов
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыФинансовогоУчетаДоходовРасходов КАК ГруппыФинансовогоУчетаДоходовРасходов
		|		ПО _ИтоговаяТаблица.ОФР = ГруппыФинансовогоУчетаДоходовРасходов.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.ОФР,
		|	ГруппыФинансовогоУчетаДоходовРасходов.Код,
		|	ГруппыФинансовогоУчетаДоходовРасходов.Описание,
		|	_ИтоговаяТаблица.Счет.Код";
#КонецОбласти				
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ЕдиницаИзмерения");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
    Настройки.Добавить("АвтоматическаяОтправка");
    Настройки.Добавить("АдресЭлектроннойПочты");
    Настройки.Добавить("АдресОтправителя");
	
	Возврат Настройки;

КонецФункции
